package maximum

/**
Стек с поддержкой максимума
Реализовать стек с поддержкой операций push, pop и max.
	Вход. Последовательность запросов push, pop и max .

	Выход. Для каждого запроса max вывести максимальное
		число, находящее на стеке.

===========

Формата входа. Первая строка содержит число запросов q. Каждая
	из последующих q строк задаёт запрос в одном из следующих
	форматов: push v, pop, or max.

Формат выхода. Для каждого запроса max в

Примеры.
	Вход:
		8
		2 7 3 1 5 2 6 2
		4
	Выход:
		7 7 5 6 6

	Вход:
		3
		2 1 5
		1
	Выход:
		2 1 5

	Вход:
		3
		2 3 9
		3
	Выход:
		9
*/

func main() {

}
