package main

/*
Ваша цель в данной задаче — реализовать симуляцию объединения
таблиц в базе данных.
	Формат входа. Первая строка содержит числа n и m — число таблиц
		и число запросов, соответственно. Вторая строка содержит n це-
		лых чисел r 1 , . . . , r n — размеры таблиц. Каждая из последующих
		m строк содержит два номера таблиц destination i и source i , кото-
		рые необходимо объединить.

	Формат выхода. Для каждого из m запросов выведите максималь-
		ный размер таблицы после соответствующего объединения.

	Ограничения. 1 ≤ n, m ≤ 100 000; 0 ≤ r i ≤ 10 000;
		1 ≤ destination i , source i ≤ n.

	Пример.
		Вход:
			5
			1
			3
			2
			1
			5
			5
			5
			1 1 1 1
			5
			4
			4
			4
			3
		Выход:
			2
			2
			3
			5
			5

*/

func main() {

}
