package main

/**
Поиск образца в тексте
Найти все вхождения строки Pattern в строку Text.
	Вход. Строки Pattern и Text.

	Выход. Все индексы i строки Text, начиная с которых стро-
		ка Pattern входит в Text:
		Text[i..i + |Pattern| − 1] = Pattern.
	Реализуйте алгоритм Карпа–Рабина.

	Формат входа. Образец Pattern и текст Text.

	Формат выхода. Индексы вхождений строки
		Pattern в строку Text в возрастающем порядке, используя индек-
		сацию с нуля.

	Ограничения. 1 ≤ |Pattern| ≤ |Text| ≤ 5 · 10 5 .
		Суммарная длина всех вхождений образ-
		ца в текста не превосходит 10 8 . Обе стро-
		ки содержат буквы латинского алфавита.
*/

func main() {

}
