package treeheight

/*
Высота дерева
Вычислить высоту данного дерева.
	Вход. 	Корневое дерево с вершинами {0, . . . , n−1}, заданное
			как последовательность parent0
			, . . . , parentn−1, где parenti —родитель i-й вершины.

	Выход.  Высота дерева.

======================

Формата входа. Первая строка содержит натуральное число n.
	Вторая строка содержит n целых неотрицательных чисел
	parent0, . . . , parentn−1. Для каждого 0 ≤ i ≤ n − 1, parenti —
	родитель вершины i; если parenti = −1, то i является корнем.
	Гарантируется, что корень ровно один. Гарантируется, что
	данная последовательность задаёт дерево.

Формат выхода. Высота дерева.

Ограничения. 1 ≤ n ≤ 105.
*/

func getTreeHeight(n int, data []int) int {

	return 1
}
