package main

/**
Ваша программа должна поддерживать следующие
типы запросов:
	• add string: добавить строку string в таблицу. Если такая
		строка уже есть, проигнорировать запрос;
	• del string: удалить строку string из таблицы. Если такой
		строки нет, проигнорировать запрос;
	• find string: вывести «yes» или «no» в зависимости от того,
		есть в таблице строка string или нет;
	• check i: вывести i-й список (используя пробел в качестве раз-
		делителя); если i-й список пуст, вывести пустую строку.
		При добавлении строки в цепочку, строка должна добавляться в на-
		чало цепочки.

	Формат входа. Первая строка размер хеш-таблицы m. Следующая
		строка содержит количество запросов n. Каждая из последую-
		щих n строк содержит запрос одного из перечисленных выше
		четырёх типов.

	Формат выхода. Для каждого из запросов типа find и check выве-
		дите результат в отдельной строке.

	Ограничения. 1 ≤ n ≤ 10 5 ; n 5 ≤ m ≤ n. Все строки имеют длину
		от одного до пятнадцати и содержат только буквы латинского
		алфавита.
*/

func main() {

}
